src/InformationRegisters/Спец_ПараметрыОбменовСДругимиБазами/Спец_ПараметрыОбменовСДругимиБазами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Спец_ПараметрыОбменовСДругимиБазами</name>
  <comment>Регистр для хранения параметров обмена с другими базами</comment>
  <resources>
    <name>ОбменВключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолноеИмяОбъектаМетаданныхПриемник</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </resources>
  <resources>
    <name>ВызыватьЗаписьПринудительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИмяРеквизитаДляПроверкиВКлючевыхОбъектах</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИскатьОбъектыБезУчетаПустогоГУИДа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИсправлятьГУИДыОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодОбменаДляПолногоОбновления</name>
    <type>
      <types>EnumRef.Спец_ПериодыОбменаДляОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>ПисатьНапрямуюВБД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПропуститьРегистрациюУдаленныхОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегистрироватьСОбменомДанными</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипОбмена</name>
    <type>
      <types>EnumRef.Спец_ТипыОбменовСДругимиБазами</types>
    </type>
  </resources>
  <resources>
    <name>ТипПередачи</name>
    <type>
      <types>EnumRef.Спец_ТипыПередачиОбъектовДляОбмена</types>
    </type>
  </resources>
  <resources>
    <name>ТолькоПолучатьГУИД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТолькоСоздаватьВБазе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоБольшаяТаблица</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПоследнегоПолногоОбновления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейПроверкиГУИДов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаДляПолученияОбъектов_Отправитель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаДляПолученияОбъектов_Получатель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаИсключения_Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаИсключения_Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстыЗапросовДляЗаписиНапрямую</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстыЗапросовДляПолногоОбновленияНапрямую</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПолногоСравнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>База</name>
    <type>
      <types>CatalogRef.Спец_Базы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолноеИмяОбъектаМетаданныхИсточник</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Спец_СоответствиеОбъектовДляОбмена/Спец_СоответствиеОбъектовДляОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Спец_СоответствиеОбъектовДляОбмена</name>
  <resources>
    <name>ТипПередачи</name>
    <type>
      <types>EnumRef.Спец_ТипыПередачиОбъектовДляОбмена</types>
    </type>
  </resources>
  <resources>
    <name>ИмяОбъектаМетаданныхПриемник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяТабличнойЧастиПриемник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяРеквизитаПриемник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПолноеИмяТипаОбъектаМетаданныхИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяТипаОбъектаМетаданныхПриемник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>База</name>
    <type>
      <types>CatalogRef.Спец_Базы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаМетаданныхИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяТабличнойЧастиИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизитаИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Спец_СтруктураТаблицБДИзДругихБаз/Спец_СтруктураТаблицБДИзДругихБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Спец_СтруктураТаблицБДИзДругихБаз</name>
  <resources>
    <name>ГУИДПеречисленияВБазеДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяТипаДанныхДляPostgreSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодТаблицыВБД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипДанных</name>
    <type>
      <types>EnumRef.Спец_ТипыДанныхБазыДанных</types>
    </type>
  </resources>
  <resources>
    <name>ТипСоставногоПоля</name>
    <type>
      <types>EnumRef.Спец_ТипыСоставныхПолейБазыДанных</types>
    </type>
  </resources>
  <dimensions>
    <name>База</name>
    <type>
      <types>CatalogRef.Спец_Базы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяТабличнойЧасти</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяТаблицыВБД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяСтолбцаВБД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Спец_ОбъектыДляРегистрацииДляОбменов/Спец_ОбъектыДляРегистрацииДляОбменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Спец_ОбъектыДляРегистрацииДляОбменов</name>
  <resources>
    <name>ТекстЗапросаИсключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоляДляИзменения</name>
    <comment>В формате JSON</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ГУИДыСовпадают</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>База</name>
    <type>
      <types>CatalogRef.Спец_Базы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолноеИмяОбъектаМетаданных</name>
    <comment>Полное имя объекта метаданных</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/Спец_ОбменСДругимиБазамиНаВремяВызоваПовтИсп/Module.bsl
// @strict-types

//@skip-check constructor-function-return-section

#Область СлужебныйПрограммныйИнтерфейс

// ++ Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя

// Параметры:
//  ПолноеИмяМетаданных - Строка
// 
// Возвращаемое значение:
//  Структура:
//		* ТаблицаСоответствиеОбъектов - ТаблицаЗначений:
//			** База - СправочникСсылка.Спец_Базы
//			** ИмяТабличнойЧастиИсточник - Строка
//			** ИмяРеквизитаИсточник - Строка
//		* ТаблицаРезультат - ТаблицаЗначений:
//			** База - СправочникСсылка.Спец_Базы
//			** РегистрироватьСОбменомДанными - Булево
//			** ИмяРеквизитаДляПроверкиВКлючевыхОбъектах - Строка
//			** ТекстЗапросаИсключения_Отправитель - Строка
//
Функция ПолучитьСтруктуруПараметровДляПроверкиУОтправителя(Знач ПолноеИмяМетаданных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ПараметрыОбменовСДругимиБазами.База КАК База,
	|	ПараметрыОбменовСДругимиБазами.ПолноеИмяОбъектаМетаданныхИсточник КАК ПолноеИмяОбъектаМетаданныхИсточник,
	|	ПараметрыОбменовСДругимиБазами.РегистрироватьСОбменомДанными КАК РегистрироватьСОбменомДанными,
	|	ПараметрыОбменовСДругимиБазами.ИмяРеквизитаДляПроверкиВКлючевыхОбъектах КАК ИмяРеквизитаДляПроверкиВКлючевыхОбъектах,
	|	ПараметрыОбменовСДругимиБазами.ТекстЗапросаИсключения_Отправитель КАК ТекстЗапросаИсключения_Отправитель
	|ПОМЕСТИТЬ втРезультат
	|ИЗ
	|	РегистрСведений.Спец_ПараметрыОбменовСДругимиБазами КАК ПараметрыОбменовСДругимиБазами
	|ГДЕ
	|	ПараметрыОбменовСДругимиБазами.ПолноеИмяОбъектаМетаданныхИсточник = &ПолноеИмяОбъектаМетаданныхИсточник
	|	И ПараметрыОбменовСДругимиБазами.ОбменВключен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРезультат.База КАК База,
	|	втРезультат.РегистрироватьСОбменомДанными КАК РегистрироватьСОбменомДанными,
	|	втРезультат.ИмяРеквизитаДляПроверкиВКлючевыхОбъектах КАК ИмяРеквизитаДляПроверкиВКлючевыхОбъектах,
	|	втРезультат.ТекстЗапросаИсключения_Отправитель КАК ТекстЗапросаИсключения_Отправитель
	|ИЗ
	|	втРезультат КАК втРезультат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоответствиеОбъектовДляОбмена.База КАК База,
	|	СоответствиеОбъектовДляОбмена.ИмяТабличнойЧастиИсточник КАК ИмяТабличнойЧастиИсточник,
	|	СоответствиеОбъектовДляОбмена.ИмяРеквизитаИсточник КАК ИмяРеквизитаИсточник
	|ИЗ
	|	РегистрСведений.Спец_СоответствиеОбъектовДляОбмена КАК СоответствиеОбъектовДляОбмена
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРезультат КАК втРезультат
	|		ПО СоответствиеОбъектовДляОбмена.База = втРезультат.База
	|		И СоответствиеОбъектовДляОбмена.ИмяОбъектаМетаданныхИсточник = втРезультат.ПолноеИмяОбъектаМетаданныхИсточник
	|ГДЕ
	|	СоответствиеОбъектовДляОбмена.ИмяРеквизитаПриемник <> """"";
	
	Запрос.УстановитьПараметр("ПолноеИмяОбъектаМетаданныхИсточник", ПолноеИмяМетаданных);
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	ВГраница       = ПакетыЗапросов.ВГраница();
	
	ТаблицаСоответствиеОбъектов = ПакетыЗапросов[ВГраница].Выгрузить();
	ТаблицаСоответствиеОбъектов.Индексы.Добавить("База, ИмяТабличнойЧастиИсточник, ИмяРеквизитаИсточник");
	
	ТаблицаРезультат = ПакетыЗапросов[ВГраница - 1].Выгрузить();
	
	Возврат Новый Структура("ТаблицаСоответствиеОбъектов, ТаблицаРезультат",
			ТаблицаСоответствиеОбъектов,
			ТаблицаРезультат);
	
КонецФункции

// Параметры:
//  База - СправочникСсылка.Спец_Базы
// 
// Возвращаемое значение:
//  Структура:
//		* ТаблицаСтруктураИзДругойБазы - ТаблицаЗначений:
//			** ИмяОбъектаМетаданных - Строка
//			** ИмяТабличнойЧасти - Строка
//			** ИмяРеквизита - Строка
//			** ИмяТаблицыВБД - Строка
//			** ИмяСтолбцаВБД - Строка
//			** ГУИДПеречисленияВБазеДанных - Строка
//			** ИмяТипаДанныхДляPostgreSQL - Строка
//			** КодТаблицыВБД - Число
//			** ТипДанных - ПеречислениеСсылка.Спец_ТипыДанныхБазыДанных
//			** ТипСоставногоПоля - ПеречислениеСсылка.Спец_ТипыСоставныхПолейБазыДанных
//		* ТаблицаСоответствиеОбъектов - ТаблицаЗначений:
// 			** ИмяОбъектаМетаданныхИсточник - Строка
// 			** ИмяТабличнойЧастиИсточник - Строка
// 			** ИмяРеквизитаИсточник - Строка
// 			** ТипПередачи - ПеречислениеСсылка.Спец_ТипыПередачиОбъектовДляОбмена
// 			** ИмяОбъектаМетаданныхПриемник - Строка
// 			** ИмяТабличнойЧастиПриемник - Строка
// 			** ИмяРеквизитаПриемник - Строка
// 			** ПолноеИмяТипаОбъектаМетаданныхИсточник - Строка
// 			** ПолноеИмяТипаОбъектаМетаданныхПриемник - Строка
//		* ТаблицаОбщиеПараметрыОбменов - ТаблицаЗначений:
//			** ПолноеИмяОбъектаМетаданныхИсточник - Строка
//			** ПолноеИмяОбъектаМетаданныхПриемник - Строка
//			** ТипПередачи - ПеречислениеСсылка.Спец_ТипыПередачиОбъектовДляОбмена
//
Функция ПолучитьСтруктуруТаблицДляФормированияТекстовЗапросов(Знач База) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтруктураТаблицБДИзДругихБаз.ИмяОбъектаМетаданных КАК ИмяОбъектаМетаданных,
	|	СтруктураТаблицБДИзДругихБаз.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	СтруктураТаблицБДИзДругихБаз.ИмяРеквизита КАК ИмяРеквизита,
	|	СтруктураТаблицБДИзДругихБаз.ИмяТаблицыВБД КАК ИмяТаблицыВБД,
	|	СтруктураТаблицБДИзДругихБаз.ИмяСтолбцаВБД КАК ИмяСтолбцаВБД,
	|	СтруктураТаблицБДИзДругихБаз.ГУИДПеречисленияВБазеДанных КАК ГУИДПеречисленияВБазеДанных,
	|	СтруктураТаблицБДИзДругихБаз.ИмяТипаДанныхДляPostgreSQL КАК ИмяТипаДанныхДляPostgreSQL,
	|	СтруктураТаблицБДИзДругихБаз.КодТаблицыВБД КАК КодТаблицыВБД,
	|	СтруктураТаблицБДИзДругихБаз.ТипДанных КАК ТипДанных,
	|	СтруктураТаблицБДИзДругихБаз.ТипСоставногоПоля КАК ТипСоставногоПоля
	|ИЗ
	|	РегистрСведений.Спец_СтруктураТаблицБДИзДругихБаз КАК СтруктураТаблицБДИзДругихБаз
	|ГДЕ
	|	СтруктураТаблицБДИзДругихБаз.База = &База
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоответствиеОбъектовДляОбмена.ИмяОбъектаМетаданныхИсточник КАК ИмяОбъектаМетаданныхИсточник,
	|	СоответствиеОбъектовДляОбмена.ИмяТабличнойЧастиИсточник КАК ИмяТабличнойЧастиИсточник,
	|	СоответствиеОбъектовДляОбмена.ИмяРеквизитаИсточник КАК ИмяРеквизитаИсточник,
	|	СоответствиеОбъектовДляОбмена.ТипПередачи КАК ТипПередачи,
	|	СоответствиеОбъектовДляОбмена.ИмяОбъектаМетаданныхПриемник КАК ИмяОбъектаМетаданныхПриемник,
	|	СоответствиеОбъектовДляОбмена.ИмяТабличнойЧастиПриемник КАК ИмяТабличнойЧастиПриемник,
	|	СоответствиеОбъектовДляОбмена.ИмяРеквизитаПриемник КАК ИмяРеквизитаПриемник,
	|	СоответствиеОбъектовДляОбмена.ПолноеИмяТипаОбъектаМетаданныхИсточник КАК ПолноеИмяТипаОбъектаМетаданныхИсточник,
	|	СоответствиеОбъектовДляОбмена.ПолноеИмяТипаОбъектаМетаданныхПриемник КАК ПолноеИмяТипаОбъектаМетаданныхПриемник
	|ИЗ
	|	РегистрСведений.Спец_СоответствиеОбъектовДляОбмена КАК СоответствиеОбъектовДляОбмена
	|ГДЕ
	|	СоответствиеОбъектовДляОбмена.База = &База
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПараметрыОбменовСДругимиБазами.ПолноеИмяОбъектаМетаданныхИсточник КАК ПолноеИмяОбъектаМетаданныхИсточник,
	|	ПараметрыОбменовСДругимиБазами.ПолноеИмяОбъектаМетаданныхПриемник КАК ПолноеИмяОбъектаМетаданныхПриемник,
	|	ПараметрыОбменовСДругимиБазами.ТипПередачи КАК ТипПередачи
	|ИЗ
	|	РегистрСведений.Спец_ПараметрыОбменовСДругимиБазами КАК ПараметрыОбменовСДругимиБазами
	|ГДЕ
	|	ПараметрыОбменовСДругимиБазами.База = &База";
	
	Запрос.УстановитьПараметр("База", База);
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	ВГраница       = ПакетыЗапросов.ВГраница();
	
	ТаблицаСтруктураИзДругойБазы = ПакетыЗапросов[ВГраница - 2].Выгрузить();
	ТаблицаСтруктураИзДругойБазы.Индексы.Добавить("ИмяОбъектаМетаданных, ИмяТабличнойЧасти");
	
	ТаблицаСоответствиеОбъектов = ПакетыЗапросов[ВГраница - 1].Выгрузить();
	ТаблицаСоответствиеОбъектов.Индексы.Добавить("ИмяОбъектаМетаданныхПриемник, ИмяТабличнойЧастиПриемник, ИмяРеквизитаПриемник");
	
	ТаблицаОбщиеПараметрыОбменов = ПакетыЗапросов[ВГраница].Выгрузить();
	ТаблицаОбщиеПараметрыОбменов.Индексы.Добавить("ПолноеИмяОбъектаМетаданныхИсточник");
	
	Возврат Новый Структура("ТаблицаСтруктураИзДругойБазы, ТаблицаСоответствиеОбъектов, ТаблицаОбщиеПараметрыОбменов",
			ТаблицаСтруктураИзДругойБазы,
			ТаблицаСоответствиеОбъектов,
			ТаблицаОбщиеПараметрыОбменов);
	
КонецФункции

// -- Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя

// ++ Спец_БСП.ОбменСДругимиБазами_ЕстьМодульПолучателя

// Параметры:
//  ПолноеИмяМетаданных - Строка
// 
// Возвращаемое значение:
//  ФиксированныйМассив из ФиксированнаяСтруктура:
//  	* База - СправочникСсылка.Спец_Базы
//  	* ПолноеИмяОбъектаМетаданных - Строка
//  	* ПоляДляИзменения - Строка
//  	* ТекстЗапросаИсключения - Строка
//
Функция ПолучитьМассивСтруктурДляПроверкиУПолучателя(Знач ПолноеИмяМетаданных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ОбъектыДляРегистрацииДляОбменов.База КАК База,
	|	ОбъектыДляРегистрацииДляОбменов.ПолноеИмяОбъектаМетаданных КАК ПолноеИмяОбъектаМетаданных,
	|	ОбъектыДляРегистрацииДляОбменов.ПоляДляИзменения КАК ПоляДляИзменения,
	|	ОбъектыДляРегистрацииДляОбменов.ТекстЗапросаИсключения КАК ТекстЗапросаИсключения
	|ИЗ
	|	РегистрСведений.Спец_ОбъектыДляРегистрацииДляОбменов КАК ОбъектыДляРегистрацииДляОбменов
	|ГДЕ
	|	ОбъектыДляРегистрацииДляОбменов.ПолноеИмяОбъектаМетаданных = &ПолноеИмяОбъектаМетаданных";
	
	Запрос.УстановитьПараметр("ПолноеИмяОбъектаМетаданных", ПолноеИмяМетаданных);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	МассивРезультат = Спец_ОбщегоНазначения.ПреобразоватьТаблицуЗначенийВМассивСтрок(ТаблицаРезультат);
	Возврат Спец_РаботаСКоллекциямиКлиентСервер.СкопироватьМассив(МассивРезультат, Истина);
	
КонецФункции

// -- Спец_БСП.ОбменСДругимиБазами_ЕстьМодульПолучателя

#КонецОбласти
